# ⚡

# <font color=blue > Project:  </font>     <font color=red > Data warehouses </font>

# ⚡

# <font color="green">Data Transformation</font>

____________

# <font color="blue">Code</font>

__________________________

# ✍

## <font color="orange">Import necessary libraries </font>

In [1]:
import pandas as pd

#### <font color="blue">To verify that the librarys is working properly</font>

In [2]:
print("['The librarie are working properly']")

['The librarie are working properly']

#### <font color="blue">Read files</font>

In [3]:
import pandas as pd

customers_df = pd.read_csv('customers_data.csv')
products_df = pd.read_csv('products_data.csv')
sales_df = pd.read_csv('sales_data.csv')

## <font color="orange">Clean and convert each file </font>


### <font color="blue">1 - customers_data </font>

In [4]:
print(customers_df.columns)

Index(['customer_id', 'customer_name', 'email', 'phone', 'address', 'city',
       'country'],
      dtype='object')

In [5]:
customers_df.shape

(50, 7)

In [6]:
customers_df.head()

,customer_id,customer_name,email,phone,address,city,country
0,1,Monica Velasquez,sextonbrian@example.net,(305)248-1660x357,"09620 Emily Stream Suite 086, North Jessicasta...",East Ashleyton,Mongolia
1,2,Keith Mullen,kchandler@example.org,3552157014,"83790 Glenn Glens, North Cindy, CO 49498",New Krystalburgh,Algeria
2,3,Tammy Sanford,xperez@example.com,(873)413-0282x88047,"071 Matthew Crescent, Mitchellport, LA 77420",Shannonfurt,Mongolia
3,4,Maria Weiss,rasmussennancy@example.org,837.216.7653x18414,"277 Hunt Ridge, West Lindsaytown, MH 83690",Seanborough,Benin
4,5,Sophia Parker,sarahwilliams@example.net,001-802-656-9088,"1337 Sarah Club Suite 958, Michaelstad, WV 95325",North Anna,United States of America

In [7]:
import pandas as pd

customers = pd.read_csv("customers_data.csv")

customers = pd.DataFrame(customers)  
customers = customers.drop_duplicates() 
customers = customers.dropna()
if 'registration_date' not in customers.columns:
    customers['registration_date'] = pd.date_range(start='2022-01-01', periods=len(customers))
else:
    customers['registration_date'] = pd.Timestamp.today()

customers = pd.DataFrame(customers)

output_file = "cleaned_customers.csv"
customers.to_csv(output_file, index=False)

In [8]:
customers.head()

,customer_id,customer_name,email,phone,address,city,country,registration_date
0,1,Monica Velasquez,sextonbrian@example.net,(305)248-1660x357,"09620 Emily Stream Suite 086, North Jessicasta...",East Ashleyton,Mongolia,2022-01-01
1,2,Keith Mullen,kchandler@example.org,3552157014,"83790 Glenn Glens, North Cindy, CO 49498",New Krystalburgh,Algeria,2022-01-02
2,3,Tammy Sanford,xperez@example.com,(873)413-0282x88047,"071 Matthew Crescent, Mitchellport, LA 77420",Shannonfurt,Mongolia,2022-01-03
3,4,Maria Weiss,rasmussennancy@example.org,837.216.7653x18414,"277 Hunt Ridge, West Lindsaytown, MH 83690",Seanborough,Benin,2022-01-04
4,5,Sophia Parker,sarahwilliams@example.net,001-802-656-9088,"1337 Sarah Club Suite 958, Michaelstad, WV 95325",North Anna,United States of America,2022-01-05

In [9]:
print(f"Data transformed and saved successfully to {output_file}!")

Data transformed and saved successfully to cleaned_customers.csv!

__________

### <font color="blue">2 - products_data
 </font>

In [10]:
print(products_df.columns)

Index(['product_id', 'product_name', 'category', 'price'], dtype='object')

In [11]:
products_df.shape

(50, 4)

In [12]:
products_df.head()

   product_id       product_name         category   price
0           1         Way Degree         Clothing  318.36
1           2       Language Cut  Home Appliances  221.96
2           3    Actually Single            Books   97.69
3           4  Specific Customer            Books  456.60
4           5       Item Control            Books   54.28

In [13]:
import pandas as pd

products = pd.read_csv("products_data.csv")

products = pd.DataFrame(products)  
products = products.drop_duplicates()  
products = products.dropna() 
products['product_id'] = products['product_id'].astype(int)

products['price'] = products['price'].astype(float)

print("\nCleaned Products Data")

output_file = "cleaned_products.csv"
products.to_csv(output_file, index=False)

print(f"\nProducts data transformed and saved successfully to {output_file}!")

Cleaned Products Data

Products data transformed and saved successfully to cleaned_products.csv!

__________

### <font color="blue">3 - sales_data </font>

In [14]:
print(sales_df.columns)

Index(['sale_id', 'customer_id', 'product_id', 'quantity', 'total_price',
       'sale_date'],
      dtype='object')

In [15]:
sales_df.shape

(50, 6)

In [16]:
sales_df.head()

   sale_id  customer_id  product_id  quantity  total_price   sale_date
0        1           10          17         6       888.42  2025-01-03
1        2            5           1         2       636.72  2025-01-11
2        3            5          40         4      1207.28  2025-01-07
3        4           49          47         3      1342.41  2025-01-27
4        5           18           5         6       325.68  2025-01-15

In [17]:
import pandas as pd

sales = pd.read_csv("sales_data.csv")

sales = pd.DataFrame(sales)  
sales = sales.drop_duplicates()  
sales = sales.dropna()  
sales['sale_date'] = pd.to_datetime(sales['sale_date'], errors='coerce')

sales['sale_price'] = sales['total_price'] / sales['quantity']

sales['product_id'] = sales['product_id'].astype(int)
sales['customer_id'] = sales['customer_id'].astype(int)

print("\nCleaned Sales Data (First 10 rows):\n")
output_file = "cleaned_sales.csv"
sales.to_csv(output_file, index=False)

print(f"\nSales data transformed and saved successfully to {output_file}!")

Cleaned Sales Data (First 10 rows):


Sales data transformed and saved successfully to cleaned_sales.csv!

In [18]:
sales.head(10)

,sale_id,customer_id,product_id,quantity,total_price,sale_date,sale_price
0,1,10,17,6,888.42,2025-01-03,148.07
1,2,5,1,2,636.72,2025-01-11,318.36
2,3,5,40,4,1207.28,2025-01-07,301.82
3,4,49,47,3,1342.41,2025-01-27,447.47
4,5,18,5,6,325.68,2025-01-15,54.28
5,6,39,36,1,303.16,2025-01-24,303.16
6,7,16,7,10,2655.80,2025-01-16,265.58
7,8,5,43,10,2733.10,2025-01-19,273.31
8,9,30,26,1,25.77,2025-01-14,25.77
9,10,3,1,5,1591.80,2025-01-22,318.36

___________

# <font color="orange">Data Integration (Customers + Sales + Products)</font>

In [19]:
sales_products = pd.merge(sales, products, on='product_id', how='inner')

final_data = pd.merge(sales_products, customers, on='customer_id', how='inner')

final_data.to_csv("final_transformed_data.csv", index=False)
print("Data Integration and saved successfully!")

Data Integration and saved successfully!

In [20]:
final_data.shape

(50, 17)

In [21]:
final_data.head(10)

,sale_id,customer_id,product_id,quantity,total_price,sale_date,sale_price,product_name,category,price,customer_name,email,phone,address,city,country,registration_date
0,1,10,17,6,888.42,2025-01-03,148.07,Fire Per,Clothing,148.07,William Berg,katie05@example.com,+1-922-318-7823x9056,"USNS Duncan, FPO AP 16042",Port Rebeccaport,Nigeria,2022-01-10
1,2,5,1,2,636.72,2025-01-11,318.36,Way Degree,Clothing,318.36,Sophia Parker,sarahwilliams@example.net,001-802-656-9088,"1337 Sarah Club Suite 958, Michaelstad, WV 95325",North Anna,United States of America,2022-01-05
2,3,5,40,4,1207.28,2025-01-07,301.82,Of Position,Clothing,301.82,Sophia Parker,sarahwilliams@example.net,001-802-656-9088,"1337 Sarah Club Suite 958, Michaelstad, WV 95325",North Anna,United States of America,2022-01-05
3,8,5,43,10,2733.10,2025-01-19,273.31,Able Democrat,Electronics,273.31,Sophia Parker,sarahwilliams@example.net,001-802-656-9088,"1337 Sarah Club Suite 958, Michaelstad, WV 95325",North Anna,United States of America,2022-01-05
4,36,5,18,7,2863.07,2025-01-11,409.01,Deal Look,Books,409.01,Sophia Parker,sarahwilliams@example.net,001-802-656-9088,"1337 Sarah Club Suite 958, Michaelstad, WV 95325",North Anna,United States of America,2022-01-05
5,10,3,1,5,1591.80,2025-01-22,318.36,Way Degree,Clothing,318.36,Tammy Sanford,xperez@example.com,(873)413-0282x88047,"071 Matthew Crescent, Mitchellport, LA 77420",Shannonfurt,Mongolia,2022-01-03
6,48,3,41,7,875.42,2025-01-07,125.06,Artist Catch,Clothing,125.06,Tammy Sanford,xperez@example.com,(873)413-0282x88047,"071 Matthew Crescent, Mitchellport, LA 77420",Shannonfurt,Mongolia,2022-01-03
7,17,45,1,3,955.08,2025-01-22,318.36,Way Degree,Clothing,318.36,Robert Simon,joseph46@example.net,769.482.3999x602,"Unit 4632 Box 4185, DPO AA 90570",Onealland,Jamaica,2022-02-14
8,12,45,11,5,1519.10,2025-01-24,303.82,Past Understand,Electronics,303.82,Robert Simon,joseph46@example.net,769.482.3999x602,"Unit 4632 Box 4185, DPO AA 90570",Onealland,Jamaica,2022-02-14
9,37,45,30,3,1157.19,2025-01-10,385.73,Condition Use,Home Appliances,385.73,Robert Simon,joseph46@example.net,769.482.3999x602,"Unit 4632 Box 4185, DPO AA 90570",Onealland,Jamaica,2022-02-14

_________________

# ✔✔